################################2
# a = int(input("Введите трехзначное число выйдит сумма этих чисел: "))
# b = a // 100
# c = a % 100 // 10
# d = a % 10
# print(b)
# print(c)
# print(d)
# print(f"Сумма цифр числа {b + c + d}")

################1
#a = int(input("Введите двухзначное число:"))
#b = a % 100 // 10
#c = a % 10
#print(b)
#print(c)
##############3
# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# c = int(input("Введите третие число: "))
# print(f"{a}{b}{c}")
###########4
c = int(input("ВВедите температуру, программа переведет градус Цельсия в Фаренгейт:"))
print(f"{(c * 9/5) + 32}")







